{"keras_version": "2.2.0", "config": [{"config": {"activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "units": 30, "kernel_constraint": null, "name": "dense_1", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 30]}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 28, "name": "dense_2", "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.1, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 20, "name": "dense_3", "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 18, "name": "dense_4", "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 10, "name": "dense_5", "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.1, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 1, "name": "dense_6", "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}